// Створити масив з трьох чисел. Змінити значення другого елемента масиву на 10.
let num = [9, 8, 11];
num[1] = 10
console.log(num);



//Створити масив із трьох рядків. Додати до масиву ще одну рядків.
let num2 = [1, 2, 3];
num2.length = 4 
num2[3] = 4
console.log(num2);



//Створити скрипт який поверне суму всіх чисел в масиві.
let num3 = [1, 2, 3, 4]
let sum = 0;
for (let i = 0; i < num3.length; i += 1){
sum += num3[i]
}
console.log(sum);




//Створити масив з 5-ти чисел. Вивести на екран всі елементи масиву за допомогою циклу for.
let numbers = [5, 10, 15, 20, 25];

for (let i = 0; i < numbers.length; i += 1) {
  console.log(numbers[i]);
}



//Створити масив із 5-ти рядків. Вивести на екран кожен рядокз масиву, який містить більше 5-ти символів.
let strings = ["вибачте", "за", "не своєчасне", "виконання", "ДЗ"];
for (let i = 0; i < strings.length; i += 1) {
  console.log(strings[i]);
}




//Створити масив з 10-ти чисел. Знайти та вивести на екран максимальне значення з масиву.
let number = [12, 45, 7, 89, 34, 67, 23, 90, 56, 11];
let max = number[0]; 
for (let i = 1; i < number.length; i += 1) {
  if (number[i] > max) {
    max = number[i];
  }
}
console.log(max);








//Створити масив з 10-ти чисел. Знайти всі парні числа в масиві та вивести їх на екран.
let num4 = [3, 12, 7, 18, 25, 30, 41, 50, 62, 77];
for (let i = 0; i < num4.length; i += 1){
    if (num4[i] % 2 === 0) {
        console.log(num4[i]);
    }
}